#include <stdio.h>
int main() {
    float scoer = 90.5;
    printf("Score: %.1f\n", scoer);

    int score = 90.5;
    printf("Score: %.1f\n", scoer);
    
    return 0;
}
//ทำไมต้องเลือกใช้ DATA TYPE เพราะจะทำให้โปรเเกรมทำงานได้อย่างมีประสิทธิภาพ และลดข้อผิดพลาดในการคำนวณ
/*สามารถ run ได้เเค่ float scoer - 90.5; จะมีการแสดงผลเป็น 90.5 แต่ int score = 90.5; จะมีการแสดงผลเป็น 90 เนื่องจาก int ไม่สามารถเก็บค่าทศนิยมได้*/
//การใช้ int เหมาะสมกับการเก็บค่าที่เป็นจำนวณเต็มเท่านั้น ในขณะที่ Float เหมาะสมกับการเก็บค่าทศนิยม
//การใช้ float จะทำให้สามารถเก็บค่าทศนิยมได้อย่างถูกต้อง ในขณะที่การใช้ int จะทำให้ค่าทศนิยมถูกปัดเศษทิ้งไป